Tests/sysbench_results_r6a.2xlarge_20250606_035526.txt
=====================================================================
SYSBENCH COMPREHENSIVE BENCHMARK RESULTS
=====================================================================
Start Time: Fri Jun  6 03:55:26 UTC 2025
Hostname: i-088c3e7d009b5997a.8067.aws-int.thomsonreuters.com
Instance Type: r6a.2xlarge
Operating System: Linux i-088c3e7d009b5997a.8067.aws-int.thomsonreuters.com 6.1.130-139.222.amzn2023.x86_64 #1 SMP PREEMPT_DYNAMIC Tue Mar 11 01:10:58 UTC 2025 x86_64 x86_64 x86_64 GNU/Linux
CPU Info: AMD EPYC 7R13 Processor AMD EPYC 7R13 Processor
CPU Cores: 8
Memory: 61Gi
=====================================================================

[2025-06-06 03:55:26] Starting Sysbench Comprehensive Benchmark Suite
[2025-06-06 03:55:26] Results will be saved to: sysbench_results_r6a.2xlarge_20250606_035526.txt
[2025-06-06 03:55:26] ================================================
[2025-06-06 03:55:26] Checking prerequisites...
[2025-06-06 03:55:26] k6 found - K6 tests will be included
[SUCCESS] Prerequisites check passed
[2025-06-06 03:55:26] Setting up PostgreSQL database and user...
[SUCCESS] PostgreSQL setup completed
[2025-06-06 03:55:27] Starting CPU benchmarks...
[2025-06-06 03:55:27] Detected 8 CPU cores

=====================================================================
SINGLE-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-06 03:55:27] Running single-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 1 eps: 37219.51 lat (ms,95%): 0.03
[ 20s ] thds: 1 eps: 37257.86 lat (ms,95%): 0.03
[ 30s ] thds: 1 eps: 37219.57 lat (ms,95%): 0.03
[ 40s ] thds: 1 eps: 37207.71 lat (ms,95%): 0.03
[ 50s ] thds: 1 eps: 37203.00 lat (ms,95%): 0.03
[ 60s ] thds: 1 eps: 37215.07 lat (ms,95%): 0.03
[ 70s ] thds: 1 eps: 37220.25 lat (ms,95%): 0.03
[ 80s ] thds: 1 eps: 37213.11 lat (ms,95%): 0.03
[ 90s ] thds: 1 eps: 37175.88 lat (ms,95%): 0.03
[ 100s ] thds: 1 eps: 37182.88 lat (ms,95%): 0.03
[ 110s ] thds: 1 eps: 37190.39 lat (ms,95%): 0.03
CPU speed:
    events per second: 37209.08

Throughput:
    events/s (eps):                      37209.0813
    time elapsed:                        120.0002s
    total number of events:              4465096

Latency (ms):
         min:                                    0.03
         avg:                                    0.03
         max:                                    0.13
         95th percentile:                        0.03
         sum:                               119570.53

Threads fairness:
    events (avg/stddev):           4465096.0000/0.00
    execution time (avg/stddev):   119.5705/0.00

[SUCCESS] Single-core CPU benchmark completed

=====================================================================
MULTI-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-06 03:57:27] Running multi-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 8 eps: 171742.50 lat (ms,95%): 0.05
[ 20s ] thds: 8 eps: 171769.19 lat (ms,95%): 0.05
[ 30s ] thds: 8 eps: 171804.27 lat (ms,95%): 0.05
[ 40s ] thds: 8 eps: 171822.18 lat (ms,95%): 0.05
[ 50s ] thds: 8 eps: 171849.86 lat (ms,95%): 0.05
[ 60s ] thds: 8 eps: 171720.99 lat (ms,95%): 0.05
[ 70s ] thds: 8 eps: 171832.76 lat (ms,95%): 0.05
[ 80s ] thds: 8 eps: 171750.24 lat (ms,95%): 0.05
[ 90s ] thds: 8 eps: 171841.46 lat (ms,95%): 0.05
[ 100s ] thds: 8 eps: 171758.66 lat (ms,95%): 0.05
[ 110s ] thds: 8 eps: 171612.12 lat (ms,95%): 0.05
CPU speed:
    events per second: 171753.48

Throughput:
    events/s (eps):                      171753.4835
    time elapsed:                        120.0002s
    total number of events:              20610455

Latency (ms):
         min:                                    0.03
         avg:                                    0.05
         max:                                   30.00
         95th percentile:                        0.05
         sum:                               957440.62

Threads fairness:
    events (avg/stddev):           2576306.8750/7932.55
    execution time (avg/stddev):   119.6801/0.01

[SUCCESS] Multi-core CPU benchmark completed
[2025-06-06 03:59:27] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed
[2025-06-06 03:59:27] Preparing PostgreSQL test data...

=====================================================================
POSTGRESQL DATA PREPARATION
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 1000000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 1000000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 1000000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 1000000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
[SUCCESS] PostgreSQL test data preparation completed
[2025-06-06 04:01:09] Starting PostgreSQL benchmarks...

=====================================================================
READ-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 04:01:09] Running Read-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 5199.46 qps: 83199.13 (r/w/o: 72799.40/0.00/10399.73) lat (ms,95%): 2.18 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 5363.04 qps: 85808.10 (r/w/o: 75082.03/0.00/10726.08) lat (ms,95%): 1.93 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 5384.39 qps: 86150.69 (r/w/o: 75381.91/0.00/10768.79) lat (ms,95%): 1.93 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 5594.31 qps: 89509.68 (r/w/o: 78321.07/0.00/11188.61) lat (ms,95%): 1.50 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 5267.30 qps: 84277.22 (r/w/o: 73742.61/0.00/10534.60) lat (ms,95%): 2.03 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 5273.59 qps: 84375.67 (r/w/o: 73828.48/0.00/10547.18) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 5523.40 qps: 88374.41 (r/w/o: 77327.61/0.00/11046.80) lat (ms,95%): 1.55 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 5537.61 qps: 88601.66 (r/w/o: 77526.54/0.00/11075.12) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 5559.69 qps: 88955.97 (r/w/o: 77836.48/0.00/11119.48) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 5587.71 qps: 89402.80 (r/w/o: 78227.39/0.00/11175.41) lat (ms,95%): 1.50 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 5543.09 qps: 88690.71 (r/w/o: 77604.54/0.00/11086.18) lat (ms,95%): 1.55 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 5552.33 qps: 88834.83 (r/w/o: 77730.26/0.00/11104.57) lat (ms,95%): 1.50 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            9154166
        write:                           0
        other:                           1307738
        total:                           10461904
    transactions:                        653869 (5448.63 per sec.)
    queries:                             10461904 (87178.02 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      5448.6264
    time elapsed:                        120.0062s
    total number of events:              653869

Latency (ms):
         min:                                    0.98
         avg:                                    1.47
         max:                                   52.84
         95th percentile:                        1.76
         sum:                               959217.72

Threads fairness:
    events (avg/stddev):           81733.6250/651.29
    execution time (avg/stddev):   119.9022/0.00

[SUCCESS] Read-Only benchmark completed

=====================================================================
WRITE-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 04:03:09] Running Write-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 1012.23 qps: 6076.39 (r/w/o: 0.00/4051.33/2025.06) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1127.42 qps: 6765.52 (r/w/o: 0.00/4510.48/2255.04) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 285.20 qps: 1711.19 (r/w/o: 0.00/1140.79/570.40) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1167.38 qps: 7004.27 (r/w/o: 0.00/4669.51/2334.76) lat (ms,95%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 308.01 qps: 1848.05 (r/w/o: 0.00/1232.04/616.02) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1115.84 qps: 6695.04 (r/w/o: 0.00/4463.36/2231.68) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 349.21 qps: 2095.29 (r/w/o: 0.00/1396.86/698.43) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 1080.06 qps: 6480.37 (r/w/o: 0.00/4320.25/2160.12) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 540.10 qps: 3240.60 (r/w/o: 0.00/2160.40/1080.20) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 960.05 qps: 5760.27 (r/w/o: 0.00/3840.18/1920.09) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 545.30 qps: 3271.80 (r/w/o: 0.00/2181.20/1090.60) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 899.70 qps: 5398.20 (r/w/o: 0.00/3598.80/1799.40) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           375656
        other:                           187828
        total:                           563484
    transactions:                        93914  (782.40 per sec.)
    queries:                             563484 (4694.41 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      782.4022
    time elapsed:                        120.0329s
    total number of events:              93914

Latency (ms):
         min:                                    1.02
         avg:                                   10.22
         max:                                  345.91
         95th percentile:                       38.25
         sum:                               960045.33

Threads fairness:
    events (avg/stddev):           11739.2500/2.68
    execution time (avg/stddev):   120.0057/0.01

[SUCCESS] Write-Only benchmark completed

=====================================================================
READ-WRITE BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 04:05:09] Running Read-Write benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 381.57 qps: 7646.52 (r/w/o: 5353.12/1529.46/763.93) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 320.81 qps: 6416.14 (r/w/o: 4491.30/1283.23/641.61) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 295.70 qps: 5913.19 (r/w/o: 4139.66/1182.12/591.41) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 631.60 qps: 12632.99 (r/w/o: 8842.66/2527.12/1263.21) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 266.90 qps: 5337.95 (r/w/o: 3736.57/1067.59/533.80) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 817.51 qps: 16347.80 (r/w/o: 11444.37/3268.42/1635.01) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 260.39 qps: 5210.01 (r/w/o: 3646.10/1043.14/520.77) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 538.52 qps: 10757.89 (r/w/o: 7529.55/2151.30/1077.05) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 570.10 qps: 11414.53 (r/w/o: 7991.15/2283.19/1140.19) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 248.49 qps: 4969.85 (r/w/o: 3478.89/993.97/496.98) lat (ms,95%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 905.54 qps: 18110.87 (r/w/o: 12677.61/3622.17/1811.09) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 257.50 qps: 5150.01 (r/w/o: 3605.00/1030.00/515.00) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            769356
        write:                           219816
        other:                           109908
        total:                           1099080
    transactions:                        54954  (457.81 per sec.)
    queries:                             1099080 (9156.17 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      457.8085
    time elapsed:                        120.0371s
    total number of events:              54954

Latency (ms):
         min:                                    2.44
         avg:                                   17.47
         max:                                  261.00
         95th percentile:                       38.94
         sum:                               960160.73

Threads fairness:
    events (avg/stddev):           6869.2500/28.58
    execution time (avg/stddev):   120.0201/0.01

[SUCCESS] Read-Write benchmark completed

=====================================================================
OLTP POINT SELECT BENCHMARK
=====================================================================

[2025-06-06 04:07:10] Running OLTP Point Select benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            868568
        write:                           0
        other:                           0
        total:                           868568
    transactions:                        868568 (86803.63 per sec.)
    queries:                             868568 (86803.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      86803.6324
    time elapsed:                        10.0061s
    total number of events:              868568

Latency (ms):
         min:                                    0.04
         avg:                                    0.09
         max:                                  121.43
         95th percentile:                        0.14
         sum:                                79711.13

Threads fairness:
    events (avg/stddev):           108571.0000/2844.30
    execution time (avg/stddev):   9.9639/0.00

[SUCCESS] OLTP Point Select benchmark completed

=====================================================================
OLTP UPDATE INDEX BENCHMARK
=====================================================================

[2025-06-06 04:07:20] Running OLTP Update Index benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           24584
        other:                           0
        total:                           24584
    transactions:                        24584  (2454.33 per sec.)
    queries:                             24584  (2454.33 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      2454.3347
    time elapsed:                        10.0166s
    total number of events:              24584

Latency (ms):
         min:                                    0.96
         avg:                                    3.26
         max:                                  155.19
         95th percentile:                        3.68
         sum:                                80081.56

Threads fairness:
    events (avg/stddev):           3073.0000/0.00
    execution time (avg/stddev):   10.0102/0.00

[SUCCESS] OLTP Update Index benchmark completed
[2025-06-06 04:07:30] Starting K6 benchmarks...
[2025-06-06 04:07:30] Truncating cache table...
TRUNCATE TABLE
[SUCCESS] Cache table truncated

=====================================================================
K6 AOT INSERT TEST
=====================================================================

[2025-06-06 04:07:30] Running K6 AOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 10313 complete and 0 interrupted iterations
default   [  10% ] 80 VUs  00m01.0s/10m0s  010314/100000 shared iters

running (00m02.0s), 80/80 VUs, 26207 complete and 0 interrupted iterations
default   [  26% ] 80 VUs  00m02.0s/10m0s  026207/100000 shared iters

running (00m03.0s), 80/80 VUs, 42274 complete and 0 interrupted iterations
default   [  42% ] 80 VUs  00m03.0s/10m0s  042274/100000 shared iters

running (00m04.0s), 80/80 VUs, 57737 complete and 0 interrupted iterations
default   [  58% ] 80 VUs  00m04.0s/10m0s  057737/100000 shared iters

running (00m05.0s), 80/80 VUs, 73117 complete and 0 interrupted iterations
default   [  73% ] 80 VUs  00m05.0s/10m0s  073117/100000 shared iters

running (00m06.0s), 80/80 VUs, 88756 complete and 0 interrupted iterations
default   [  89% ] 80 VUs  00m06.0s/10m0s  088756/100000 shared iters
time="2025-06-06T04:07:37Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-06T04:07:38Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=8.62ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  14857.709829/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=5.18ms min=424.21µs med=4.59ms max=305.52ms p(90)=7.3ms  p(95)=8.62ms
      { endpoint:postgres_insert }..............................................: avg=5.18ms min=424.21µs med=4.59ms max=305.52ms p(90)=7.3ms  p(95)=8.62ms
      { expected_response:true }................................................: avg=5.18ms min=424.21µs med=4.59ms max=305.52ms p(90)=7.3ms  p(95)=8.62ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 14857.858406/s

    EXECUTION
    iteration_duration..........................................................: avg=5.34ms min=509.71µs med=4.71ms max=307.4ms  p(90)=7.61ms p(95)=9.08ms
    iterations..................................................................: 100000 14857.709829/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.4 MB/s
    data_sent...................................................................: 26 MB  3.9 MB/s



running (00m06.7s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m06.7s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Insert test completed

=====================================================================
K6 AOT QUERY TEST
=====================================================================

[2025-06-06 04:07:38] Running K6 AOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-06T04:07:38Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-06T04:07:38Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-06T04:07:38Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-06T04:07:38Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-06T04:07:38Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-06T04:07:38Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-06T04:07:38Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-06T04:07:38Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-06T04:07:38Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-06T04:07:38Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-06T04:07:38Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-06T04:07:38Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 15512 complete and 0 interrupted iterations
default   [  16% ] 80 VUs  00m00.9s/10m0s  015512/100000 shared iters

running (00m02.0s), 80/80 VUs, 32399 complete and 0 interrupted iterations
default   [  32% ] 80 VUs  00m01.9s/10m0s  032401/100000 shared iters

running (00m03.0s), 80/80 VUs, 49140 complete and 0 interrupted iterations
default   [  49% ] 80 VUs  00m02.9s/10m0s  049141/100000 shared iters

running (00m04.0s), 80/80 VUs, 66318 complete and 0 interrupted iterations
default   [  66% ] 80 VUs  00m03.9s/10m0s  066318/100000 shared iters

running (00m05.0s), 80/80 VUs, 83458 complete and 0 interrupted iterations
default   [  83% ] 80 VUs  00m04.9s/10m0s  083458/100000 shared iters
time="2025-06-06T04:07:44Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-06T04:07:44Z" level=info msg="INFO: Teardown cleanup finished." source=console

running (00m06.0s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m05.9s/10m0s  100000/100000 shared iters


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=7.92ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  50344.062973/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=4.52ms min=360.54µs med=4.18ms max=19.2ms  p(90)=6.77ms p(95)=7.92ms
      { endpoint:postgres_get }.............................................: avg=4.53ms min=360.54µs med=4.18ms max=19.2ms  p(90)=6.77ms p(95)=7.92ms
      { expected_response:true }............................................: avg=4.52ms min=360.54µs med=4.18ms max=19.2ms  p(90)=6.77ms p(95)=7.92ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 16798.303492/s

    EXECUTION
    iteration_duration......................................................: avg=4.7ms  min=454.96µs med=4.31ms max=22.38ms p(90)=7.07ms p(95)=8.32ms
    iterations..............................................................: 100000 16781.354324/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  3.6 MB/s
    data_sent...............................................................: 13 MB  2.2 MB/s



running (00m06.0s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m05.9s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Query test completed

=====================================================================
K6 NAOT INSERT TEST
=====================================================================

[2025-06-06 04:07:44] Running K6 NAOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 5719 complete and 0 interrupted iterations
default   [   6% ] 80 VUs  00m01.0s/10m0s  005719/100000 shared iters

running (00m02.0s), 80/80 VUs, 17143 complete and 0 interrupted iterations
default   [  17% ] 80 VUs  00m02.0s/10m0s  017143/100000 shared iters

running (00m03.0s), 80/80 VUs, 28822 complete and 0 interrupted iterations
default   [  29% ] 80 VUs  00m03.0s/10m0s  028822/100000 shared iters

running (00m04.0s), 80/80 VUs, 40694 complete and 0 interrupted iterations
default   [  41% ] 80 VUs  00m04.0s/10m0s  040694/100000 shared iters

running (00m05.0s), 80/80 VUs, 54282 complete and 0 interrupted iterations
default   [  54% ] 80 VUs  00m05.0s/10m0s  054282/100000 shared iters

running (00m06.0s), 80/80 VUs, 70805 complete and 0 interrupted iterations
default   [  71% ] 80 VUs  00m06.0s/10m0s  070805/100000 shared iters

running (00m07.0s), 80/80 VUs, 87462 complete and 0 interrupted iterations
default   [  87% ] 80 VUs  00m07.0s/10m0s  087462/100000 shared iters
time="2025-06-06T04:07:51Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-06T04:07:51Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=9.92ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  12881.132523/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=6ms    min=386.81µs med=5.22ms max=514.31ms p(90)=8.42ms p(95)=9.92ms 
      { endpoint:postgres_insert }..............................................: avg=6ms    min=386.81µs med=5.22ms max=514.31ms p(90)=8.42ms p(95)=9.92ms 
      { expected_response:true }................................................: avg=6ms    min=386.81µs med=5.22ms max=514.31ms p(90)=8.42ms p(95)=9.92ms 
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 12881.261335/s

    EXECUTION
    iteration_duration..........................................................: avg=6.17ms min=485.66µs med=5.34ms max=515.17ms p(90)=8.7ms  p(95)=10.34ms
    iterations..................................................................: 100000 12881.132523/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.2 MB/s
    data_sent...................................................................: 26 MB  3.3 MB/s



running (00m07.8s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m07.7s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Insert test completed

=====================================================================
K6 NAOT QUERY TEST
=====================================================================

[2025-06-06 04:07:52] Running K6 NAOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-06T04:07:52Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-06T04:07:52Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-06T04:07:52Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-06T04:07:52Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-06T04:07:52Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-06T04:07:52Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-06T04:07:52Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-06T04:07:52Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-06T04:07:52Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-06T04:07:52Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-06T04:07:52Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-06T04:07:52Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 14008 complete and 0 interrupted iterations
default   [  14% ] 80 VUs  00m00.9s/10m0s  014008/100000 shared iters

running (00m02.0s), 80/80 VUs, 31162 complete and 0 interrupted iterations
default   [  31% ] 80 VUs  00m01.9s/10m0s  031162/100000 shared iters

running (00m03.0s), 80/80 VUs, 48909 complete and 0 interrupted iterations
default   [  49% ] 80 VUs  00m02.9s/10m0s  048909/100000 shared iters

running (00m04.0s), 80/80 VUs, 66271 complete and 0 interrupted iterations
default   [  66% ] 80 VUs  00m03.9s/10m0s  066271/100000 shared iters

running (00m05.0s), 80/80 VUs, 83542 complete and 0 interrupted iterations
default   [  84% ] 80 VUs  00m04.9s/10m0s  083542/100000 shared iters
time="2025-06-06T04:07:57Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-06T04:07:57Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=7.91ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  50784.266257/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=4.48ms min=284.41µs med=4.12ms max=41.4ms  p(90)=6.67ms p(95)=7.91ms
      { endpoint:postgres_get }.............................................: avg=4.48ms min=284.41µs med=4.12ms max=41.4ms  p(90)=6.68ms p(95)=7.91ms
      { expected_response:true }............................................: avg=4.48ms min=284.41µs med=4.12ms max=41.4ms  p(90)=6.67ms p(95)=7.91ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 16945.186122/s

    EXECUTION
    iteration_duration......................................................: avg=4.66ms min=384.52µs med=4.24ms max=43.75ms p(90)=7ms    p(95)=8.37ms
    iterations..............................................................: 100000 16928.088752/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  3.6 MB/s
    data_sent...............................................................: 13 MB  2.2 MB/s



running (00m05.9s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m05.9s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Query test completed
[SUCCESS] All available K6 benchmarks completed
[2025-06-06 04:07:58] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed

=====================================================================
BENCHMARK COMPLETION
=====================================================================
End Time: Fri Jun  6 04:07:58 UTC 2025
Duration: 12 minutes and 32 seconds
Results saved to: sysbench_results_r6a.2xlarge_20250606_035526.txt
=====================================================================
[2025-06-06 04:07:58] ================================================
[SUCCESS] All benchmarks completed successfully!
[2025-06-06 04:07:58] Detailed results saved to: sysbench_results_r6a.2xlarge_20250606_035526.txt